{"name":"Sharksholdings","cryptocurrencies":["btc","eth","ltc"],"description":"\nMy project is an investment platform \n\nWhat is Sharks Holdings? A few years ago we’ve started to discover the various investment options available on the Internet. We’ve tried numerous HYIP, revshare and other hybrid programs and always hoped they won’t shut down ahead of time....Show more...My project is an investment platform \n\nWhat is Sharks Holdings? A few years ago we’ve started to discover the various investment options available on the Internet. We’ve tried numerous HYIP, revshare and other hybrid programs and always hoped they won’t shut down ahead of time. Unfortunately our experience was rather disappointing, the vast majority of these sites didn’t last too long and sooner or later closed down. In most cases they suffered from different kinds of financial trouble, there was even a case when the system was hit by a cyber attack and couldn't resume business afterwards. The most secure solution seemed to be diversification, splitting our capital into 10-15 different investment programs. This way we could mitigate the risk since we deployed only a portion of our money in each system instead of risking all at one place. That method worked for us! We’ve had enough of the unreliability and constant uncertainty! We wanted a stable, reliable source of income that gives the opportunity also to others to earn a healthy passive revenue without being concerned about their money. This was our mission in creating this website where your profit is generated from a diversified portfolio of at least 15 different investment programs. You don’t buy a pig in a poke. Our website is constantly updated to show you the current portfolio, all the programs that we use to eliminate your investment risks. Our goal is a solution that stands the test of time and provides you a stable, reliable one stop shop for your investment needs. This is the Sharks Holdings.\n","image":"https://cryptwerk.com/upload/companies/7000/sharksholdings.jpg?1578994068","tags":["Marketing, Ads, PR","Investments"],"latLong":"41.8780025,-93.097702","address":"3500 Iowa Ava apt 614 89123","socials":{"facebook":"https://www.facebook.com/groups/Sharksholding/","telegram":"https://t.me/joinchat/HILtfVYdRSz2ranU3-PStQ"}},{"name":"Changelly.com","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xmr","xrp","etc","zec","alts","qtum","xlm","nem","zrx","grs","kmd"],"description":"\nChangelly is a popular cryptocurrency exchange providing the ability to instantly and seamlessly exchange over 100 altcoins at the best market rate or buy them using a bank card.\n\nOperating since 2015, Changelly has attracted over 2M registered users from around the world. Currently, the...Show more...Changelly is a popular cryptocurrency exchange providing the ability to instantly and seamlessly exchange over 100 altcoins at the best market rate or buy them using a bank card.\n\nOperating since 2015, Changelly has attracted over 2M registered users from around the world. Currently, the service processes more than 15K transactions weekly with a monthly turnover of around 60K BTC.\n\nChangelly offers its API and a customizable payment widget for any crypto service that wishes to increase its turnover. The exchange provides its Affiliate program with a quite appealing revenue share mechanism. Changelly is a partner with Jaxx, Coinmarketcap, BRD, Mycelium, Coinpayments, Uquid debit card, Coinomi, and other prominent companies.\n\nAbount Changelly\nWe offer you an intuitive interface, the best exchange rates and secure transactions. We aspire to establish mutual trust with our clients; thereof we don’t have any hidden or unreasonable fees. We always charge only 0.5% fee and that’s it, full stop.\n\nIf you are interested in cooperation or have any suggestions\nfor us, drop a message to [email protected]\n","image":"https://cryptwerk.com/upload/companies/0/changelly-com.jpg?1","tags":["Exchanges","Buy / Sell"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/changellyteam","twitter":"https://twitter.com/changelly_team"}},{"name":"Changeangel.io","cryptocurrencies":["btc","eth","ltc","dgb","alts","btg","dcr","pot","grs"],"description":"\nChangeAngel.io is a crypto to crypto, wallet to wallet, no-custody, swap exchange service. The first currencies to be listed for direct swapping are: DGB, POT, GRS, DCR, LTC, BTC, ETH and USDC.\n\nBut, there is more to the ChangeAngel story. We are on a mission to create sustainable ways to...Show more...ChangeAngel.io is a crypto to crypto, wallet to wallet, no-custody, swap exchange service. The first currencies to be listed for direct swapping are: DGB, POT, GRS, DCR, LTC, BTC, ETH and USDC.\n\nBut, there is more to the ChangeAngel story. We are on a mission to create sustainable ways to support non ICO, open-source, decentralized blockchain development. This means that as you buy your favorite cryptos, you are also supporting your favorite blockchain development. To start, we will donate a portion of swap revenue to DigiByte, PotCoin, Groestle, Decred and LiteCoin to continue their development.\n\nAs our platform grows, we plan to support additional open-source, nonprofit blockchain projects.\n\nChangeAngel will also employ innovative blockchain solutions to enhance our platform, develop new products and promote dApp integration. Currently, we are using AntumID/Digi-ID for sign-in/sign-up authentication. AntumID is powered by DigiByte Blockchain technology.\n\nAt ChangeAngel we believe we can create The “Swap Exchange for Social Good.” It is our hope that other businesses will join our endeavor to support open source blockchain development through sustainable efforts.\n","image":"https://cryptwerk.com/upload/companies/3000/changeangel-io.jpg?1554284208","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/ChangeAngel-2193808460874161/","twitter":"https://twitter.com/ChangeAngel_io?s=09","instagram":"https://instagram.com/changeangel.io/","linkedin":"https://www.linkedin.com/company/changeangel","telegram":"https://t.me/ChangeAngel_io"}},{"name":"Holy Transaction","cryptocurrencies":["btc","eth","ltc","dash","doge","zec","dcr","grs","alts"],"description":"\nHoly Transaction is a multi crypto currency wallet.\nIt allows you to store and exchange, Bitcoin, Litecoin, Dogecoin, Peercoin, Dash, Ethereum, Decred, Zcash, Syscoin, Faircoin, Gamecredits, Gridcoin and Blackcoin. \nAt the moment the app is only web based. They are launching a new service...Show more...Holy Transaction is a multi crypto currency wallet.\nIt allows you to store and exchange, Bitcoin, Litecoin, Dogecoin, Peercoin, Dash, Ethereum, Decred, Zcash, Syscoin, Faircoin, Gamecredits, Gridcoin and Blackcoin. \nAt the moment the app is only web based. They are launching a new service with profit sharing called Flyp.me.\n","image":"https://cryptwerk.com/upload/companies/1000/holy-transaction.jpg?1","tags":[],"latLong":"49.815317,6.086365","address":"Luxembourg","socials":{"facebook":"https://www.facebook.com/holytransaction","twitter":"https://twitter.com/holytransaction"}},{"name":"Bitify.com","cryptocurrencies":["btc","ltc"],"description":"\nWe started as CryptoThrift back in September 2013 and have grown and overcome a lot of challenges along the way.\n\nWe offer a built in escrow service like no other in the Bitcoin eco-system. Our 30 days buyer protection and money back feature allows buyers to buy with bitcoin securely knowing...Show more...We started as CryptoThrift back in September 2013 and have grown and overcome a lot of challenges along the way.\n\nWe offer a built in escrow service like no other in the Bitcoin eco-system. Our 30 days buyer protection and money back feature allows buyers to buy with bitcoin securely knowing they will receive what they paid for or their money back. Our escrow service is the most trusted Bitcoin escrow service in the world. We have processed over $6m USD so far with over 75,000 items sold through our escrow service. We have hosted large funds raising events such as the Original Art Work of cryptograffiti signed by Dorian Nakamoto and the Satoshi Labs Direct Relief #OneSafePregnancy campaign .\n\nBitify PTY LTD is an Australian registered company. We are based in Australia, but offer a worldwide service with majority of our customers in the United States, European Union and South East Asia.\n\nThe support of our users, both buyers and sellers, has been awesome over the years and we’d like to thank you for that!\n","image":"https://cryptwerk.com/upload/companies/0/bitify-com.jpg?1","tags":["Marketplaces","Escrow"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/Bitify.PTYLtd","twitter":"https://twitter.com/bitify_com"}},{"name":"Bithoven","cryptocurrencies":["btc","eth","ltc","bch","dash","xmr","xrp","zec","dgb","nem"],"description":"\nBithoven.com is a multifunctional cryptocurrency trading platform that has managed to prove itself as a reliable and professional crypto trading service provider. In essence, Bithoven.com offers high liquidity in the order book, speed and accuracy of operations on the exchange, as well as margin...Show more...Bithoven.com is a multifunctional cryptocurrency trading platform that has managed to prove itself as a reliable and professional crypto trading service provider. In essence, Bithoven.com offers high liquidity in the order book, speed and accuracy of operations on the exchange, as well as margin trading services with using leverage up to 1:20 and Bitcoin as the nominal margin currency. The crypto exchange is open to partnership proposals and renders listing of new tokens according to qualifying parameters. For a relatively short period of time, Bithoven.com has succeeded in earning the clients’ trust and genuine interest owing to its intuitive user interface, advanced security system, use of data encryption tools and provision of professional customer care services.\n","image":"https://cryptwerk.com/upload/companies/7000/bithoven.jpg?1564999589","tags":["Exchanges","Trading"],"latLong":"53.29395,-6.13586","address":"Suite 305, Griffith Corporate Centre, PO BOX 1510, Beachmont, Kingstown, Saint Vincent and the Grenadines.","socials":{"facebook":"https://www.facebook.com/bithovencom/","twitter":"https://twitter.com/Bithoven_com"}},{"name":"NuVoo","cryptocurrencies":["btc","eth","ltc"],"description":"\nOur primary focus is to offer cost effective solutions to cryptocurrency hobbyists and professionals. We have the conviction our enterprise can follow you in the adventure or cryptocurrency.\n\nAlways listening to our clients of our community. We studied cryptocurrencies and we formed a team of...Show more...Our primary focus is to offer cost effective solutions to cryptocurrency hobbyists and professionals. We have the conviction our enterprise can follow you in the adventure or cryptocurrency.\n\nAlways listening to our clients of our community. We studied cryptocurrencies and we formed a team of experts to lead this project with success. NuVoo’s philosophy is to enroll the best leaders in the cryptocurrency industry and to have them available to the community.\n\nNuvoo offers you a smart and easy way to take your first step into the crypto world. The Bitcoin mining system is ideal for beginners. Our system also offers solutions for experts and large-scale entrepreneurs from one unit farm to multiple tier-1 home dedicated mining farm.\n","image":"https://cryptwerk.com/upload/companies/0/nuvoo.jpg?1","tags":[],"latLong":"46.7677269,-71.2887151","address":"P. Lordos Center, Bloc B second floor, office 203, Limassol, 3015, Cyprus","socials":{}},{"name":"247Bids LLC","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xmr","xrp","etc","btg","bsv","grs","xvg"],"description":"\nWe're a fun and exciting, Cryptocurrency auction website. \n\nYou can win popular cryptocurrencies at incredibly low prices. Look at our live auctions to see what cryptocurrencies are up for auction right now, and if one catches your eye, buy some bids under Buy Bids tab for a low price! When...Show more...We're a fun and exciting, Cryptocurrency auction website. \n\nYou can win popular cryptocurrencies at incredibly low prices. Look at our live auctions to see what cryptocurrencies are up for auction right now, and if one catches your eye, buy some bids under Buy Bids tab for a low price! When you place a bid, we add a 15-30 seconds to the timer - to give others the chance to bid if they're interested. This is similar to the \"Going Once...Twice...SOLD\" approach of auctions.\n","image":"https://cryptwerk.com/upload/companies/7000/247bids-llc.jpg?1564691593","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/247BidsHQ/","twitter":"https://twitter.com/247BidsHQ","instagram":"https://www.instagram.com/247bids/","telegram":"https://t.me/HQ247Bids","youtube":"https://www.youtube.com/channel/UCcdyMgt3EtR58O8f2fBZY7w"},"paymentGateways":["CoinPayments"]},{"name":"Coinminer","cryptocurrencies":["btc","ltc"],"description":"\nCoinMiner is a professional mining operation, founded in 2013 by a team of experts specializing in the use of cryptocurrencies. The company’s focus on enabling individuals and businesses to pursue mining and e-commerce-related activities within this space is part of an overall effort to...Show more...CoinMiner is a professional mining operation, founded in 2013 by a team of experts specializing in the use of cryptocurrencies. The company’s focus on enabling individuals and businesses to pursue mining and e-commerce-related activities within this space is part of an overall effort to streamline this entire process. \n\nAcclaimed by colleagues and media (CNN included) alike, CoinMiner is a global leader for the good of merchants, entrepreneurs and established corporations.\n","image":"https://cryptwerk.com/upload/companies/0/coinminer.jpg?1","tags":["Mining","Mining"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/coinminercom","twitter":"https://twitter.com/coinminercom","youtube":"https://www.youtube.com/channel/UCOQVRyNh6ntQ0nP9UbpCtOA"}},{"name":"Aloborio","cryptocurrencies":["btc","eth","xlm"],"description":"\n- Start accepting payments in cryptocurrency\n- Integrate your cryptocurrency payment gateway with Aloborio to enable fiat withdrawals for your merchants\n- Integrate cryptocurrencies with Fiat payment gateways - extend list of payment methods. Merchant get local currency, no action required\n","image":"https://cryptwerk.com/upload/companies/6000/aloborio.jpg?1565798538","tags":["Buy / Sell","Wallets"],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/aloboriocom","instagram":"https://www.instagram.com/block_pen/","linkedin":"https://www.linkedin.com/company/blockpenofficial","telegram":"https://t.me/aloborio","whatsapp":"https://wa.me/79833000505","skype":"skype:live:5f922981fd1ba8a5","youtube":"https://www.youtube.com/channel/UCCF0EhMOG70F0P4tg8jXgCg","github":"https://github.com/aloborio"}},{"name":"Biterwallet","cryptocurrencies":["btc","ltc","dash"],"description":"\nBiterwallet is a person-to-person exchange, where you can sell and buy Cryptomoney with more than 100 forms of payment to choose from.\n\nCurrently the system supports Bitcoin, Litecoin and Dash.\n\nFeatures:\n* Support for all payment methods and all currencies. (We can add any currency or form...Show more...Biterwallet is a person-to-person exchange, where you can sell and buy Cryptomoney with more than 100 forms of payment to choose from.\n\nCurrently the system supports Bitcoin, Litecoin and Dash.\n\nFeatures:\n* Support for all payment methods and all currencies. (We can add any currency or form of payment if you need it).\n* Set your own payment time, set your range limits and price margin.\n* Deposit in guarantee: Guarantees that all operations are backed by a security deposit where they can not withdraw the Crypros if they suffer from any fraud attempt.\n* Dispute system: A Biterwallet agent will be available to resolve the dispute.\n* Reputation system: All buyers or sellers can qualify how the operation was and leave a comment.\n* View user online or offline.\n* Trusted users: You can add any user as a trusted user and you will have it in your calendar for future purchases / sales.\n* Price in real time: The prices of the offers are updated every 5 minutes.\n* Live Chat: You can chat with the merchant in real time.\n* Instant Notifications by SMS and Email.\nAnd much more.\n\nBitcoin Wallet, Litecoin and Dash.\nUnlike other exchanges, in Biterwallet you can get a totally free wallet. Where when buying or selling their cryptos, they will be available for withdrawal at any time.\n\nSecurity:\nWe have a high security rank with the support of BitGo and COMODO Secure services.\nUnlike other exchanges the website does not store your money, instead it uses multisig addresses to finance offers directly.\nAn example when buying bitcoin through the platform. Once the purchase is made, the bitcoin will move through the blockchain, needing to be confirmed as any other wallet to wallet sent.\n\nTwo Factor Authentication is also available: You can use Google Authenticator or Authy to be your most secure account, you can enable it to access your account and to release the collateral deposits when marketing.\n\nCommissions:\n\nWe do not charge any commission when using the wallet for Bitcoin, Litecoin or Dash.\nBut keep in mind when sending you will be charged a fee that is for the miners, Biterwallet does not benefit at all.\n\nThe only commission charged is to make a purchase/sale exchange that is 1%.\n\nWe also wrote 2 short tutorials:\n\nHow to buy Cryptos: https://biterwallet.com/comprar-bitcoin-tutorial.html\nHow to sell Cryptos: https://biterwallet.com/como-vender-bitcoin.html\n\n\nWe hope to provide a great service, where anyone can buy/sell cryptos easily and safely.\n\nThe website: https://biterwallet.com\nAny question or problem can be addressed to the support: [email protected]\n\nAny suggestion is Welcome, Thank you very much.\n","image":"https://cryptwerk.com/upload/companies/1000/biterwallet.jpg?1547074691","tags":["Exchanges","Buy / Sell","Wallets"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/BiterWallet-341649749983341/","bitcointalk":"https://bitcointalk.org/index.php?topic=5095207"}},{"name":"Pungo Card","cryptocurrencies":["btc","ltc","bch","dash","doge","dgb","qtum","btg","smart","grs","zil","kmd"],"description":"\nDebit card program - From blockchain to your pocket\n","image":"https://cryptwerk.com/upload/companies/7000/pungo-card.jpg?1568039666","tags":["Buy / Sell","Cards"],"latLong":"undefined,undefined","socials":{"facebook":"https://facebook.com/pungoio","twitter":"https://twitter.com/pungoio","telegram":"https://t.me/pungotalk","medium":"https://medium.com/@pungoio","bitcointalk":"https://bitcointalk.org/index.php?topic=5029192.0"}},{"name":"Free Faucets and Airdrops","cryptocurrencies":["btc","eth","ltc","doge","alts","xlm"],"description":"\nGet and Earn Free Bitcoin and Altcoins Airdrops and Claim Coins Faucets every Five Minuts\n","image":"https://cryptwerk.com/upload/companies/7000/free-faucets-and-airdrops.jpg?1571970326","tags":["Exchanges","Services"],"latLong":"25.3262884,49.5845434","address":"3014 Al Amir Bandar Ibn Abdul Aziz","socials":{"facebook":"https://www.facebook.com/groups/bitcoinbyarabic","twitter":"https://twitter.com/sarahalshe5","instagram":"https://instagram.com/ya7lelkom"}},{"name":"Waves Games","cryptocurrencies":["waves"],"description":"\nWavesGames is an incredible online gaming platform that allows people to play and win real money backed by blockchain technology. Our main focus at WavesGames is the development of reliable and transparent games. \n\nOur goal is to create games based on blockchain and that our token is useful...Show more...WavesGames is an incredible online gaming platform that allows people to play and win real money backed by blockchain technology. Our main focus at WavesGames is the development of reliable and transparent games. \n\nOur goal is to create games based on blockchain and that our token is useful for all those people who want to create a game and base it on the blockchain. All WavesGames transactions are executed through the Waves network, which provides speed, tranquility and guaranteed security to players who use our gaming platform. WavesGames will do everything legally and get an official game license before the platform becomes operational.\n","image":"https://cryptwerk.com/upload/companies/7000/waves-games.jpg?1569933801","tags":["Buy / Sell","Games"],"latLong":"12.879721,121.774017","address":"philipines","socials":{"facebook":"https://t.me/WavesGamesWG","twitter":"https://t.me/WavesGamesWG","instagram":"https://t.me/WavesGamesWG"}},{"name":"Uznopay","cryptocurrencies":["btc"],"description":"\nUznopay e-currency exchange service. Quick changes, low commission, hassle-free support. 7/24 exchange possibility. Perfectmoney Certified Partner\n","image":"https://cryptwerk.com/upload/companies/7000/uznopay.jpg?1576692018","tags":[],"latLong":"41.0082376,28.9783589","address":"Istanbul TURKEY","socials":{},"fiatPaymentModes":["Perfect Money"]},{"name":"Ginco","cryptocurrencies":["btc","eth","xrp","bch","ltc","eos","etc","omg","zrx","zil","alts"],"description":"\nGinco is the next generation cryptocurrency wallet which allows to safely manage your cryptocurrencies, send and receive funds with low fees on your smartphone. Bitcoin, Bitcoin Cash, Ethereum and ERC-20 are compatible now, and many more coming soon.\n","image":"https://cryptwerk.com/upload/companies/1000/ginco.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/gincoapp/","twitter":"https://twitter.com/ginco_app","medium":"https://medium.com/gincowallet"}},{"name":"Bankera Exchange","cryptocurrencies":["btc","eth","ltc","dash","xrp","zec","usdt"],"description":"\nTrade Bitcoin, Ether, Ripple and many more crypto assets.\n","image":"https://cryptwerk.com/upload/companies/8000/bankera-exchange.jpg?1586166645","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/bankeraexchange","twitter":"https://twitter.com/BankeraExchange","instagram":"https://www.instagram.com/BankeraExchange/"}},{"name":"Mobi","cryptocurrencies":["btc","eth","xrp","bch","ltc","eos","usdt","xmr","dash","zec","btg","omg","zrx","zil","alts"],"description":"\nThe Mobi wallet is available for Android and iOS and supports up to 15 languages. When downloading the wallet, it will be linked to the mobile number with which you downloaded the app. Users can choose which currency to work with and can convert between 100+ currencies (including silver and...Show more...The Mobi wallet is available for Android and iOS and supports up to 15 languages. When downloading the wallet, it will be linked to the mobile number with which you downloaded the app. Users can choose which currency to work with and can convert between 100+ currencies (including silver and gold). Using a private blockchain, Mobi allows users to send funds to any of the 2 billion other smartphone users out there and to any of Twitter’s 319 million users.\nUsers can also request an optional Visa debit card which is linked to their Mobi account and allows them to withdraw cash in any currency at ATMs worldwide or spend their funds at any retail points of sale that support Visa. The debit card automatically deducts funds from customers’ wallet balance.\n","image":"https://cryptwerk.com/upload/companies/1000/mobi.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/BTCCmobi/","twitter":"https://twitter.com/BTCCmobi","linkedin":"https://www.linkedin.com/company-beta/13268600"}},{"name":"Сoinmama.com","cryptocurrencies":["btc","eth","xrp","bch","ltc","ada","etc"],"description":"\nBuy bitcoin / Buy ethereum / Buy ripple / Buy litecoin / Buy bitcoin cash / Buy cardano / Buy qtum / Buy ethereum classic / Buy cryptocurrency\n\nEmpowering humanity.\n\nOne human at a time.\nWe’re Coinmama, a financial service that makes it fast, safe and fun to buy digital currency, anywhere...Show more...Buy bitcoin / Buy ethereum / Buy ripple / Buy litecoin / Buy bitcoin cash / Buy cardano / Buy qtum / Buy ethereum classic / Buy cryptocurrency\n\nEmpowering humanity.\n\nOne human at a time.\nWe’re Coinmama, a financial service that makes it fast, safe and fun to buy digital currency, anywhere in the world. We believe that the future of money is one where we, the people, are in control of our own economy. A future where there’s no place for middle-men, hidden fees and fine print.\n\nTo deliver on that promise, we have come to work every day since 2013 to create the simplest financial service out there - spoken in a language you can understand, and backed by customer service you can count on.\n","image":"https://cryptwerk.com/upload/companies/0/soinmama-com.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/Coinmama/","twitter":"https://twitter.com/Coinmamacom"}},{"name":"Zcash Freewallet","cryptocurrencies":["zec"],"description":"\nZcash Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your ZEC funds and is available for Android devices through Google Play and for iOS in the Apple App Store.\nFeatures:\n•  Login with Email, Facebook,...Show more...Zcash Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your ZEC funds and is available for Android devices through Google Play and for iOS in the Apple App Store.\nFeatures:\n•  Login with Email, Facebook, Google+ or mobile phone number;•  Send ZEC to almost any altcoin address;•  Top up the wallet with almost any coin and receive ZEC;•  Coins are stored in Cold storage;•  App is secured and supported;•  Real-time ZEC price and charts;•  Balance in fiat currencies;•  Restore wallet from any device;•  PIN code and Fingerprint Login;•  QR Code Support;•  Optional email confirmation for all transactions;•  Direct link to ZEC block explorer in transactions details;•  Email notifications about balance changes;•  Share your wallet address via Twitter, Facebook, email and more;•  Multiple language support, including Chinese, German, French, Spanish, Russian and more;•  2-factor authentication;•  Impeccable 24/7 customer service;•  Simple and beautiful Freewallet interface.\n","image":"https://cryptwerk.com/upload/companies/1000/zcash-freewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/freewallet.org","twitter":"https://twitter.com/freewalletorg"}},{"name":"Coinfinity","cryptocurrencies":[],"description":"\nCoinfinity is an expert center for Bitcoin and cryptographic currencies with its headquarters in the creative quarter of Lend in Graz, Austria. Coinfinity creates products and solutions around Bitcoin, operates Austria’s first Bitcoin ATM and offers consulting services and a platform for...Show more...Coinfinity is an expert center for Bitcoin and cryptographic currencies with its headquarters in the creative quarter of Lend in Graz, Austria. Coinfinity creates products and solutions around Bitcoin, operates Austria’s first Bitcoin ATM and offers consulting services and a platform for information and discussion. We from Coinfinity want to facilitate the access to Bitcoin and crypto-currencies for private individuals and companies. We believe that in order for technologies such as Bitcoin to become mainstream, the right priorities have to be set.\n","image":"https://cryptwerk.com/upload/companies/4000/coinfinity.jpg?1558027651","tags":[],"latLong":"47.073558,15.432814","address":"21 Mariahilferstraße, Graz, Stmk. 8020, AT","socials":{"facebook":"https://www.facebook.com/coinfinityco","twitter":"https://twitter.com/coinfinityco"}},{"name":"Lisk Freewallet","cryptocurrencies":["alts"],"description":"\nThe Dogecoin Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your LSK funds and is available for Android devices through Google Play and for iOS in the Apple App Store.\nFeatures:\n• Login with Email, Facebook...Show more...The Dogecoin Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your LSK funds and is available for Android devices through Google Play and for iOS in the Apple App Store.\nFeatures:\n• Login with Email, Facebook and Google +• Top up Lisk wallet with almost any currency: USD, BTC, LTC, DOGE etc.• Built-in exchange to 10+ coins• Coins are stored in cold storage• App is secured and supported• LSK price and statistics• Restore wallet from any Android&amp;iOS device• Simple and beautiful Freewallet interface\n","image":"https://cryptwerk.com/upload/companies/1000/lisk-freewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/freewallet.org","twitter":"https://twitter.com/freewalletorg"}},{"name":"Truckcoin Wallet","cryptocurrencies":["alts"],"description":"\nThe Truckcoin wallet was built by its developers specifically to hold the coin made by Goldenhill International, Truckcoin (TRCK). The wallet is supported by Windows, Mac OS, Linux and mobile platforms Android and iOS.\n","image":"https://cryptwerk.com/upload/companies/0/truckcoin-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/Truckcoinofficial","twitter":"https://twitter.com/TruckCoin","telegram":"https://t.me/trkcgroup"}},{"name":"Coinjar Wallet","cryptocurrencies":["btc","eth","xrp","ltc"],"description":"\nCoinjar is an easy to use wallet interface that concentrates on mobile devices.\nYou can also use a prepaid debit coinjar card to swipe and pay. \nCoinjar also has its own exchange allowing conversion between Australian dollars and Bitcoin.\nThe Australian equivalent of Coinbase.\n \n","image":"https://cryptwerk.com/upload/companies/1000/coinjar-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/CoinJar","twitter":"https://twitter.com/GetCoinJar"}},{"name":"Morph","cryptocurrencies":["btc","eth","xrp","ltc","xlm","neo"],"description":"\nMorph is a multi-cryptocurrency wallet that supports XRP, BTC, ETH, XLM, LTC, NEO, and GAS. It is available on Android, iOS and Web browser and features 2FA.\n","image":"https://cryptwerk.com/upload/companies/0/morph.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/morphwallet","twitter":"https://twitter.com/morph_wallet"}},{"name":"Bitlox Wallet","cryptocurrencies":["btc","bch"],"description":"\nThe BitLox Bitcoin Hardware wallet is the Rolls Royce of Bitcoin wallets with its wealth of features and high levels of bespoke security coming encased in titanium if you so wish. Although difficult to use in terms of getting to grips with all its features - the Bitlox wallet is treasure trove...Show more...The BitLox Bitcoin Hardware wallet is the Rolls Royce of Bitcoin wallets with its wealth of features and high levels of bespoke security coming encased in titanium if you so wish. Although difficult to use in terms of getting to grips with all its features - the Bitlox wallet is treasure trove for those keen on privacy and security. A list of the features an be found below.\n\nMobile with Bluetooth LE for low power usage and extended battery life\nCredit card form factor\n4 mm thin – smallest in its class\n2″ full matrix advanced e-paper display – can display address QR codes when fully powered off\nIndestructible shockproof &amp; weatherproof metal case\nCan be charged with any micro-USB cable\nMultiple languages supported\nDisplay and sign free-form messages with address key – proving users identity\nNIST certified True Random Number Generator to secure user signatures\nOver 100 wallets possible, each of which can generate millions of unique addresses\nThe seed for each wallet is encrypted via PINs\nEmergency PIN irrevocably wipes all user data\nFull alphanumeric keypad directly on the device – entering PINs has never been more secure\nPINs may be up to 20 characters in length, alphanumeric [0-9a-zA-Z]\n12, 18 or 24 word mnemonic backups enable recovery of all funds if the BitLox is ever lost or stolen\nMnemonic phrases are compatible with leading web wallets and open source tools\nWallet recovery from mnemonics is done ONLY on the device, no phrase entry on a computer to worry about.\nStylish and advanced design that will be the envy of all\nFully BIP32 &amp; BIP39 compliant\nLightweight yet robust at only 25 g\nInternally calculates transaction fees &amp; displays them – never get a \"surprise\" with fees\nFree leather carrying case\n\n \n","image":"https://cryptwerk.com/upload/companies/1000/bitlox-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/bitloxwallet","twitter":"https://twitter.com/BitLox","youtube":"https://www.youtube.com/c/Bitlox"}},{"name":"BitClassic","cryptocurrencies":["alts"],"description":"\nBitClassic is an open-source wallet for the users of B2C crypto-currency. It is designed to store, send and accept BitClassic (B2C) payments.\n","image":"https://cryptwerk.com/upload/companies/0/bitclassic.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/bitclassic.org/","twitter":"https://twitter.com/classic_bit","instagram":"https://www.instagram.com/bitclassic/","telegram":"https://t.me/bitclassic","github":"https://github.com/bitclassic-B2C/BitClassic","bitcointalk":"https://bitcointalk.org/index.php?topic=3764776.0"}},{"name":"LykkeWallet","cryptocurrencies":["btc","eth"],"description":"\nLykke Wallet is a key element of the Lykke trading ecosystem. The Lykke Wallet iOS and Android apps make it simple for you to trade digital currencies and assets on the Lykke Exchange, our next-generation trading platform with zero commission. Immediate settlement and direct ownership are...Show more...Lykke Wallet is a key element of the Lykke trading ecosystem. The Lykke Wallet iOS and Android apps make it simple for you to trade digital currencies and assets on the Lykke Exchange, our next-generation trading platform with zero commission. Immediate settlement and direct ownership are enabled by distributed ledger technology. Now anyone can trade easily!\n","image":"https://cryptwerk.com/upload/companies/1000/lykkewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/LykkeCity","twitter":"https://twitter.com/LykkeCity","instagram":"https://instagram.com/lykkecity","linkedin":"https://www.linkedin.com/company/lykke","youtube":"https://www.youtube.com/c/LykkeX"}},{"name":"Coinbase Wallet","cryptocurrencies":["btc","eth","bch","ltc","etc","erc20"],"description":"\nCoinbase is one of the larger Bitcoin ecosystems offering a full service across wallets, exchanges to merchant payment software.\nThe wallet advantage of this is that transactions can be done off the blockchain although this does detract from the main ethos of Bitcoin. \nUsing Coinbase is a...Show more...Coinbase is one of the larger Bitcoin ecosystems offering a full service across wallets, exchanges to merchant payment software.\nThe wallet advantage of this is that transactions can be done off the blockchain although this does detract from the main ethos of Bitcoin. \nUsing Coinbase is a good experience but does mean you are trusting a third party with your Bitcoins unless you use their vault service. Essentially the banking industry form of security boxes in a safe.\n","image":"https://cryptwerk.com/upload/companies/1000/coinbase-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/coinbase","github":"https://github.com/CoinbaseWallet"}},{"name":"Kcash Wallet","cryptocurrencies":["btc","eth","bch","ltc","eos","etc","erc20"],"description":"\nKCash is a mobile wallet for Ethereum-based tokens, Bitcoin, Litecoin, Bitcoin Cash, and ACT. It features 2-factor authentication, multi-signature and a one-time backup with 12 words for all the assets (BIP32, BIP39, BIP44 supported), providing a secure wallet. The validation type is SPV making...Show more...KCash is a mobile wallet for Ethereum-based tokens, Bitcoin, Litecoin, Bitcoin Cash, and ACT. It features 2-factor authentication, multi-signature and a one-time backup with 12 words for all the assets (BIP32, BIP39, BIP44 supported), providing a secure wallet. The validation type is SPV making unnecessary to download the entire blockchain.\n","image":"https://cryptwerk.com/upload/companies/1000/kcash-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/KcashOfficial","twitter":"https://twitter.com/Kcashofficial","telegram":"https://t.me/KcashOfficial"}},{"name":"Edge","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xmr","xrp","etc","dgb","btg","grs","alts"],"description":"\nEdge is a decentralized and secure mobile multicurrency wallet. Rebranded from Airbitz, the Edge Wallet provides true financial autonomy & privacy for its users. Neither Edge nor any 3rd party can access users' funds or data within the Edge wallet. A clean, user-first interface solves many of...Show more...Edge is a decentralized and secure mobile multicurrency wallet. Rebranded from Airbitz, the Edge Wallet provides true financial autonomy & privacy for its users. Neither Edge nor any 3rd party can access users' funds or data within the Edge wallet. A clean, user-first interface solves many of the usability issues plaguing current wallet solutions while adding features including:\n\nEase of Use\n\nDecentralized server architecture. Wallets work even if Edge servers are down\nSupports Bluetooth Low Energy (BLE) to transfer funds instead of scanning QR codes\nSimple account creation using just a login &amp; password (no printing or emailing of PDFs, writing down passphrases or adding encryption settings)\nAutomatic wallet encryption, backup, and multi-device synchronization\n","image":"https://cryptwerk.com/upload/companies/1000/edge.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/EdgeSecure","instagram":"https://www.instagram.com/edgewallet/","linkedin":"https://www.linkedin.com/company/3609678/","telegram":"https://t.me/joinchat/AAAAAEG4wXOcIlHhXL2Now","github":"https://github.com/EdgeApp"}},{"name":"CoinVault","cryptocurrencies":["btc","ltc","dash","doge","alts"],"description":"\nCoinVault is a easy to use multi-cryptocurrency Web wallet. Users can store Bitcoin, Litecoin, Digital Cash, DogeCoin, GridCoin, Namecoin, PeerCoin, Quark, Reddcoin, Terracoin and Primecoin in one place. CoinVault provides mnemonic sentences for easy backup and wallet private keys that...Show more...CoinVault is a easy to use multi-cryptocurrency Web wallet. Users can store Bitcoin, Litecoin, Digital Cash, DogeCoin, GridCoin, Namecoin, PeerCoin, Quark, Reddcoin, Terracoin and Primecoin in one place. CoinVault provides mnemonic sentences for easy backup and wallet private keys that are controlled by the user, in order to ensure greater safety. CoinVault is currently in the beta stage and in the process of adding more cryptocurrencies to their wallet\n","image":"https://cryptwerk.com/upload/companies/1000/coinvault.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/coinvaultIO/","twitter":"https://twitter.com/coinvault_io","github":"https://github.com/CoinVault"}},{"name":"FantomCoin Freewallet","cryptocurrencies":["alts"],"description":"\nFantomCoin Free Wallet is an easy-to-use mobile wallet with a built-in cryptocurrency exchange. Free Wallet provides cold storage security for your FCN funds and is available for Android devices through Google Play.\nFeatures:\n• Login with Email, Facebook, Google+ or mobile phone number;•...Show more...FantomCoin Free Wallet is an easy-to-use mobile wallet with a built-in cryptocurrency exchange. Free Wallet provides cold storage security for your FCN funds and is available for Android devices through Google Play.\nFeatures:\n• Login with Email, Facebook, Google+ or mobile phone number;• Send FCN to almost any altcoin address;• Top up the wallet with almost any coin and receive FCN;• Coins are stored in Cold storage;• App is secured and supported;• Real-time FCN price and charts;• Balance in fiat currencies;• Restore wallet from any device;• PIN code and Fingerprint Login;• QR Code Support;• Optional email confirmation for all transactions;• Direct link to FCN block explorer in transactions details;• Email notifications about balance changes;• Share your wallet address via Twitter, Facebook, email and more;• Multiple language support, including Chinese, German, French, Spanish, Russian and more;• 2-factor authentication;• Impeccable 24/7 customer service;• Simple and beautiful Freewallet interface.\n","image":"https://cryptwerk.com/upload/companies/1000/fantomcoin-freewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/freewallet.org","twitter":"https://twitter.com/freewalletorg"}},{"name":"BlueWallet","cryptocurrencies":["btc"],"description":"\nWe are Bitcoin enthusiasts focused on bringing the revolution to the people. ?\nReach out, we will appreciate your feedback.\n\nBlueWallet is a free opensource Bitcoin wallet exclusively for iOS. It has a flexible fee system where the user can choose which amount to pay (starting from 1 Satoshi)...Show more...We are Bitcoin enthusiasts focused on bringing the revolution to the people. ?\nReach out, we will appreciate your feedback.\n\nBlueWallet is a free opensource Bitcoin wallet exclusively for iOS. It has a flexible fee system where the user can choose which amount to pay (starting from 1 Satoshi) and it will affect the transaction speed, the more the fee value, the fastest the transaction.\n","image":"https://cryptwerk.com/upload/companies/1000/bluewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/bluewalletio","reddit":"https://www.reddit.com/r/bluewallet/","github":"https://github.com/Overtorment/BlueWallet"}},{"name":"NXT Freewallet","cryptocurrencies":["nxt"],"description":"\nThe NXT Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your NXT funds and is available for Android devices through Google Play.\nFeatures:\n• Login with Email, Facebook and Google +• Top up NXT wallet with...Show more...The NXT Freewallet is an easy-to-use mobile wallet with a built in cryptocurrency exchange. Free Wallet provides cold storage security for your NXT funds and is available for Android devices through Google Play.\nFeatures:\n• Login with Email, Facebook and Google +• Top up NXT wallet with almost any currency: USD, BTC, LTC, DOGE etc.• Built-in exchange to 10+ coins• Coins are stored in cold storage• App is secured and supported• NXT price and statistics• Restore wallet from any Android device• Simple and beautiful Freewallet interface\n","image":"https://cryptwerk.com/upload/companies/1000/nxt-freewallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/freewallet.org","twitter":"https://twitter.com/freewalletorg"}},{"name":"BTC Wallet","cryptocurrencies":["btc","bch"],"description":"\nThe BTC Wallet is a highly intuitive open source bitcoin wallet available for the web browser, iOS and Android. The wallet does not require users to store the blockchain as validation is centralized. The wallet supports eight languages.\nBTC Wallet also focuses on providing simple but...Show more...The BTC Wallet is a highly intuitive open source bitcoin wallet available for the web browser, iOS and Android. The wallet does not require users to store the blockchain as validation is centralized. The wallet supports eight languages.\nBTC Wallet also focuses on providing simple but efficient security. It has 2-fa login and a backup file that is downloaded when creating the wallet. The file has the information and instructions required to recover the BTC Wallet or password should anyhting happen. The file also contains the info on public keys.\nThe wallet was previously named Blocktrail until it was acquired by Bitmain and rebranded to BTC Wallet as one of the services offered at BTC.com. Other services include a mining pool, block explorer and a useful multi-purpose app that can be used on mobile or as a chrome extension.\n","image":"https://cryptwerk.com/upload/companies/1000/btc-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/btccom","twitter":"https://twitter.com/btccom_official"}},{"name":"Zelcore","cryptocurrencies":["btc","eth","ltc","bch","dash","xmr","zec","etc","btg","bnb","usdt","omg","zrx","grs","zil","kmd"],"description":"\nAbout zelcore\n\nZelCore is a multi asset platform and wallet, free-to-use by all, with top quick-swap exchanges. ZelCore+ unlocks advanced trading functionality with API integrations to the top exchanges + TradingView.\n\nSupporting more than 100+ assets including\n","image":"https://cryptwerk.com/upload/companies/7000/zelcore.jpg?1568041128","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/zelcash","telegram":"https://t.me/zelcash","reddit":"https://www.reddit.com/r/ZelCash/","bitcointalk":"https://bitcointalk.org/index.php?topic=2853688.0","discord":"https://discord.io/zel"}},{"name":"BitFi","cryptocurrencies":["btc","eth","ltc","xmr","neo","bnb","grs","erc20"],"description":"\nBitFi is an Open-source connected hardware device that stores multiple cryptocurrencies and assets. The Bitfi wallet costs $120 and requires no technical skills. Users don´t have to download or install any applications on their computer or hardware device. Instead, the BitFi device...Show more...BitFi is an Open-source connected hardware device that stores multiple cryptocurrencies and assets. The Bitfi wallet costs $120 and requires no technical skills. Users don´t have to download or install any applications on their computer or hardware device. Instead, the BitFi device automatically adds all the latest updates and features by receiving updates directly from their node in real time. \nUnlike other conventional hardware wallets where private keys are stored on a device outside the computer, the Bitfi wallet calculates private keys using an algorithm every time the user types in their secret phrase. Once a transaction is approved, the private key is not stored anywhere. The private key does not exist on the device until you type in your secret phrase again. Therefore if a user´s device is stolen or seized, there is no way to gain access to the private key without the pin.\n","image":"https://cryptwerk.com/upload/companies/1000/bitfi.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/Bitfi6"}},{"name":"247 Bits, Inc.","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xmr","xrp","etc","btg","bnb","bsv","xvg"],"description":"\nCrypto Card Wallets: ﻿Our cards are similar to paper wallets, however you don’t have to worry about getting the paper wallet wet or faded ink. Instead, 247 Bits offers you a much better solution by transforming your paper wallet into a card. The results are a lot better, because you get to...Show more...Crypto Card Wallets: ﻿Our cards are similar to paper wallets, however you don’t have to worry about getting the paper wallet wet or faded ink. Instead, 247 Bits offers you a much better solution by transforming your paper wallet into a card. The results are a lot better, because you get to make sure that your wallet is always used the right way.\n","image":"https://cryptwerk.com/upload/companies/7000/247-bits-inc.jpg?1564691957","tags":["Wallets","Cards"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/247Bits","twitter":"https://twitter.com/247BitsHQ","instagram":"https://www.instagram.com/247bits/","telegram":"https://t.me/HQ247Bits","youtube":"https://www.youtube.com/c/247Bits","pinterest":"https://www.pinterest.com/247Bits/"}},{"name":"NEO Tracker Wallet","cryptocurrencies":["neo"],"description":"\nThe NEO Tracker Wallet is a web wallet for NEO and GAS. This is a light wallet, no local synchronization to the blockchain is required, they use a remote server to access transactions and GAS claims. \n","image":"https://cryptwerk.com/upload/companies/1000/neo-tracker-wallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/neotracker.io/","twitter":"https://twitter.com/neotrackerio"}},{"name":"Verus","cryptocurrencies":["btc","zec","kmd"],"description":"\nNo specialized hardware is required!\nStake with minimal CPU power.\nStake directly from the Verus Wallet.\n","image":"https://cryptwerk.com/upload/companies/7000/verus.jpg?1568041679","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/veruscoin","medium":"https://medium.com/@veruscoinV","github":"https://github.com/veruscoin/veruscoin","bitcointalk":"https://medium.com/@veruscoin","discord":"https://discord.gg/VRKMP2S"}},{"name":"OmniWallet","cryptocurrencies":["btc"],"description":"\nPrivate keys are never sent to the server except in an encrypted form.\nYou can deploy the Omniwallet on your own server and host your own instance, or use one of the service providers that will host it for you - your money, your choice.\nOmniwallet comes with a pre-built support for Bitcoin,...Show more...Private keys are never sent to the server except in an encrypted form.\nYou can deploy the Omniwallet on your own server and host your own instance, or use one of the service providers that will host it for you - your money, your choice.\nOmniwallet comes with a pre-built support for Bitcoin, Omni and Test Omni.\nAn easy to use web interface for using mastercoin.\n","image":"https://cryptwerk.com/upload/companies/1000/omniwallet.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/groups/523941304389744/","twitter":"https://twitter.com/omniwallet"}},{"name":"Paykassa.pro","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xrp","xmr","etc","zec","trx","xlm"],"description":"\nProvide services of receiving payments on the website\n\nPayKassa — the service helps to instantly accept payments on your website and make bulk payments through many payment systems.\n\nCryptocurrency wallet:\n0% fee for Deposit and withdrawal\nCryptocurrency of the TOP 30\nInvoices without...Show more...Provide services of receiving payments on the website\n\nPayKassa — the service helps to instantly accept payments on your website and make bulk payments through many payment systems.\n\nCryptocurrency wallet:\n0% fee for Deposit and withdrawal\nCryptocurrency of the TOP 30\nInvoices without connecting merchant\nWallet accessible from your computer, tablet, smartphone\n\nOnline acceptance of cryptocurrency:\nPayments in the cryptocurrency for any type of business\nMinimal moderation and a high level of anonymity\nReady-made modules for all popular CMS systems\nInstant and massive payouts\n","image":"https://cryptwerk.com/upload/companies/2000/paykassa-pro.jpg?1551372049","tags":["Wallets","Payment gateways"],"latLong":"41.1342632,-104.8205721","address":"1908 Thomes Ave Cheyenne, WY 82001 USA","socials":{"facebook":"https://www.facebook.com/PayKassa.pro","telegram":"https://t.me/paykassa","vk":"https://vk.com/club60486387"}},{"name":"Savvy","cryptocurrencies":["btc","eth","bch","ltc","dash","etc","btg"],"description":"\nWhy Savvy?\n\nEASY TO USE\nMerge ERC20 token balances\nClick once and consolidate chosen tokens across your ETH accounts.\n\nPRIVATE AND SECURE\nDecentralized & Audited\nFunds are under your control, and only yours. Ask no one’s permission.\n\nCOMPREHENSIVE\nExchange assets anytime\nSeamlessly...Show more...Why Savvy?\n\nEASY TO USE\nMerge ERC20 token balances\nClick once and consolidate chosen tokens across your ETH accounts.\n\nPRIVATE AND SECURE\nDecentralized & Audited\nFunds are under your control, and only yours. Ask no one’s permission.\n\nCOMPREHENSIVE\nExchange assets anytime\nSeamlessly swap coins and tokens within your wallet anytime.\n\n\nMERCHANT ENABLED\nConnecting everyday people with merchants\nBuy things with crypto. Pay Savvy Merchants online.\n\nSavvy Features\n\nCrypto for everyday use\nReceive, store and send 1,000+ cryptos\nExchange 100+ cryptos instantly\nSpend it with 3,000+ Savvy merchants\n\nEasy peer to peer payments\nCreate your personal link and share it easily. Help others know it's you they're paying, for free, for life.\n\nCreate your link now\nMagic filters for your cluttered transactions\nSearch and organize by date, amount, status or action type. See what you want, when you want it.\n","image":"https://cryptwerk.com/upload/companies/2000/savvy.jpg?1551822873","tags":["Wallets","Payment gateways"],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/getsavvyio","telegram":"https://t.me/savvyio","medium":"https://medium.com/savvyio"}},{"name":"Bittreo","cryptocurrencies":["btc"],"description":"\nWe are offering you Bitcoin ATM in Vancouver and Victoria. Get the best bitcoin exchange with us and explore our other services. To avail today, visit our website.\n\nBittreo provides financial services and products for digital assets. Founded in 2017, Bittreo originally launched as “Vancouver...Show more...We are offering you Bitcoin ATM in Vancouver and Victoria. Get the best bitcoin exchange with us and explore our other services. To avail today, visit our website.\n\nBittreo provides financial services and products for digital assets. Founded in 2017, Bittreo originally launched as “Vancouver Bitcoin”, a retail cryptocurrency brokerage located in Vancouver, BC. Today, Bittreo offers a variety of products and services making investing in digital assets easier than ever.\n","image":"https://cryptwerk.com/upload/companies/7000/bittreo.jpg?1568762330","tags":["ATM","Trading"],"latLong":"49.276154,-123.134897","address":"1807 Burrard street unit 202 Vancouver British Columbia V6J 1H9 Canada","socials":{"facebook":"https://www.facebook.com/Bittreo/","twitter":"https://twitter.com/bittreo"}},{"name":"CRYPTO MONEY BANK","cryptocurrencies":["btc","eth","ltc","dash","erc20"],"description":"\nQUIENES SOMOS\n\nUn banco privado descentralizado de cryptoactivos, donde el control del dinero siempre esta en tus manos, sin restricción, sin bloqueo y de fácil manejo. Nuestros clientes siempre poseen sus llaves publicas y privadas de sus cuentas, no almacenamos valores, no guardamos...Show more...QUIENES SOMOS\n\nUn banco privado descentralizado de cryptoactivos, donde el control del dinero siempre esta en tus manos, sin restricción, sin bloqueo y de fácil manejo. Nuestros clientes siempre poseen sus llaves publicas y privadas de sus cuentas, no almacenamos valores, no guardamos llaves.\n\nMISION\n\nSer uno de los principales bancos descentralizados de criptoactivos del mundo, sirviendo de plataforma de servicio confiable, amigable y sencilla para la ejecución descentralizada de transacciones de criptoactivos y brindando productos y servicios de vanguardia que garanticen el mayor grado de seguridad posible a nuestros clientes y usuarios.\n\nVISION\n\nPosicionarnos dentro de las principales referencias de la banca descentralizada de criptoactivos a nivel mundial, sirviendo como plataforma amigable y confiable de transacciones y surtiendo de productos de seguridad y de facilitación de uso de criptoactivos para un gran número de clientes y usuarios.\n","image":"https://cryptwerk.com/upload/companies/7000/crypto-money-bank.jpg?1578307720","tags":["Wallets","Payment gateways"],"latLong":"47.3768866,8.541694","address":"Zurich Switzerland","socials":{"twitter":"https://twitter.com/@cryptombank","instagram":"https://www.instagram.com/@cryptombank/"}},{"name":"BitcoinPay.com","cryptocurrencies":["btc","eth","ltc","dash","xrp"],"description":"\nOur idea is simple, but powerful – we believe everyone should be able to easily and inexpensively accept payments instantly, no matter where in the world they are, without risking fraud or charge-backs.\n\nWho we are\nOur team consists of top-notch financiers, traders, and experienced...Show more...Our idea is simple, but powerful – we believe everyone should be able to easily and inexpensively accept payments instantly, no matter where in the world they are, without risking fraud or charge-backs.\n\nWho we are\nOur team consists of top-notch financiers, traders, and experienced developers. We work hard, every day, to make P2P digital currency payments simple and accessible for everyone.\n","image":"https://cryptwerk.com/upload/companies/0/bitcoinpay-com.jpg?1","tags":[],"latLong":"51.5976017,-0.1100645","address":"Dept 613, 196 High Road, Wood Green London, United Kingdom, N22 8HH","socials":{"facebook":"https://www.facebook.com/BitcoinPaycom-658259894317262/","twitter":"https://twitter.com/bitcoin_pay","linkedin":"https://www.linkedin.com/company/bitcoinpay-com"}},{"name":"BitAccess ATM","cryptocurrencies":[],"description":"\nBitAccess Bitcoin ATM located in workspace Campus London operated by Bitbuddy.\n\nFrom start-ups to Fortune 500 companies, Bitaccess provides blockchain software services to power Fintech businesses in over 15 countries. Our products include Bitcoin ATMs (BTM), Explorecatena.com,...Show more...BitAccess Bitcoin ATM located in workspace Campus London operated by Bitbuddy.\n\nFrom start-ups to Fortune 500 companies, Bitaccess provides blockchain software services to power Fintech businesses in over 15 countries. Our products include Bitcoin ATMs (BTM), Explorecatena.com, BuyBitcoinCanada.com, faa.st and more...\n","image":"https://cryptwerk.com/upload/companies/3000/BitAccess-atm.jpg?1557993176","tags":[],"latLong":"51.507351,-0.12766","address":"5 Bonhill St, London, England EC2A 4BX, UK","socials":{"facebook":"https://www.facebook.com/bitaccess","twitter":"https://twitter.com/BitAccess","linkedin":"https://www.linkedin.com/company/bitaccess"}},{"name":"Bitaps.com","cryptocurrencies":["btc"],"description":"\nBitaps company was founded in 2015. We are a company of enthusiastic people inspired by Bitcoin, programming and cryptography algorithms.\n\nWe have been watching Bitcoin since 2011, using Bitcoins since 2012, we experienced Bitcoin’s price in November 2013, have been mining Bitcoins since...Show more...Bitaps company was founded in 2015. We are a company of enthusiastic people inspired by Bitcoin, programming and cryptography algorithms.\n\nWe have been watching Bitcoin since 2011, using Bitcoins since 2012, we experienced Bitcoin’s price in November 2013, have been mining Bitcoins since 2014, and all that with sincere love and trust to Bitcoin!\n\nFrom 2015 we started software development for Bitcoin technology. We have developed our own node implementation based on Bitcoin protocol. Our software platform provides many features for discovering blockchain, controlling events in Bitcoin network and big data operations management.\n\nOur first public product is a block explorer website. You can find a real-time information about Bitcoin network events, statistics and can use API for your own applications. Block explorer based on high performance node, that is connected to over 500 worldwide nodes. Explorer database model allows to store all events include orphaned blocks, double spending activity, broken transactions and reach access to any address information. \n\nThe main priority for us is users’ privacy, security and clarity as it is designed in Bitcoin ideology. We believe in borderless economy, where each idea is worth something and each person is important.\n","image":"https://cryptwerk.com/upload/companies/1000/bitaps-com.jpg?1","tags":[],"latLong":"55.7497929,37.5374139","address":"Presnenskaya embankment 6 building 2, Fl. 16 MIBC \"Moscow-city\" Tower \"Empire\" Moscow 100000 Russian Federation","socials":{"facebook":"https://www.facebook.com/bitapscom","twitter":"https://twitter.com/bitaps_com"}},{"name":"Heliopay Bitcoin ATM","cryptocurrencies":[],"description":"\nBitcoin ATM’s, point of sale, services and supplies, digital infrastructure, payment management solutions and more! We deliver first class equipment creating access to exciting new markets and consumers as these technologies take hold.\n\nIndustry leading equipment, the UK’s widest range of...Show more...Bitcoin ATM’s, point of sale, services and supplies, digital infrastructure, payment management solutions and more! We deliver first class equipment creating access to exciting new markets and consumers as these technologies take hold.\n\nIndustry leading equipment, the UK’s widest range of bitcoin merchandise for resale (now including the UK’s largest range of physical bitcoins), consultancy, technology integration, excellent training, we help our customers at all stages of the adoption process, helping them to prepare for the new wave of digital payment services, software and infrastructures required. We make it simple!\n\nLocated in Portsmouth\n","image":"https://cryptwerk.com/upload/companies/3000/heliopay-bitcoin-atm.jpg?1557999006","tags":[],"latLong":"50.760901,-1.158485","address":"Elm Grove, Portsmouth, England PO5 1LN, UK","socials":{"facebook":"https://www.facebook.com/heliopay","twitter":"https://twitter.com/Heliopay"}},{"name":"Ezdefi.com","cryptocurrencies":["btc","eth","ltc","bch","dash","trx","qtum","bnb","dcr","usdt"],"description":"\nWith EzDeFi solutions, you can accept cryptocurrencies on your website easily at lowest cost (0 – 0.1% per transaction) without middlemen.\n\nThe innovation of crypto payments processor\n\nPayment without middleman\nLow Gateway Processing Fees\nBorderless, Fast, and Secure Payments\nSupport...Show more...With EzDeFi solutions, you can accept cryptocurrencies on your website easily at lowest cost (0 – 0.1% per transaction) without middlemen.\n\nThe innovation of crypto payments processor\n\nPayment without middleman\nLow Gateway Processing Fees\nBorderless, Fast, and Secure Payments\nSupport Multiple Cryptocurrencies\nNo Chargebacks\n\nAccept Multiple Coins\n\nThere are about 2,500 cryptocurrencies available on the market, so it’s really cumbersome for customers to choose which one can be used to invest or pay from that batch. See full list of supported coins/tokens\n","image":"https://cryptwerk.com/upload/companies/7000/ezdefi-com.jpg?1579108935","tags":[],"latLong":"undefined,undefined","socials":{}},{"name":"Athena Bitcoin ATM","cryptocurrencies":["btc","ltc","bch"],"description":"\nATM Model: Satoshi-1\nBitcoin, cash to crypto\nLimits: $2500/transaction $7500/day\nFees: 5-8% depending on customer, lower fees for VIP customers\n","image":"https://cryptwerk.com/upload/companies/4000/athena-bitcoin.jpg?1558029460","tags":[],"latLong":"39.956714,-75.150398","address":"8 West Chelten Avenue, Philadelphia, PA 19144, US","socials":{"facebook":"https://www.facebook.com/athenabitcoin","twitter":"https://twitter.com/athenabitcoin"}},{"name":"Confirmo","cryptocurrencies":["btc","ltc"],"description":"\nWe do one thing, properly\n\nOur passion and utmost care reflect in every detail of our service. We want you to feel at ease bringing an additional value to your business. We don't offer a wallet or an exchange service.\n\nWe focus on one thing single-handedly: building a crypto payment gateway,...Show more...We do one thing, properly\n\nOur passion and utmost care reflect in every detail of our service. We want you to feel at ease bringing an additional value to your business. We don't offer a wallet or an exchange service.\n\nWe focus on one thing single-handedly: building a crypto payment gateway, such you won't find anywhere else.\n\nPayment gateway\n\nSince 2014 we have fiddled about with every detail of our crypto payment gateway to make your experience intuitive and hassle-free.\n\nPayout\n\nPayout enables you to automatically send crypto payments directly from available EUR or USD balance. It only takes a few seconds to execute the Payout order. You don't have to worry about the security risks associated with holding crypto and their exchange rate volatility.\n","image":"https://cryptwerk.com/upload/companies/8000/confirmo.jpg?1584630810","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/confirmo.net/","twitter":"https://twitter.com/confirmoltd","linkedin":"https://www.linkedin.com/company/5391370/"}},{"name":"CapitainAltcoin","cryptocurrencies":["btc","alts"],"description":"\nCaptain Altcoin is made up of investors and digital currency enthusiasts.\n\nWe have seen a strong need for better media coverage in the industry as the rise and popularity of digital currency is at an all-time high.\n\nWhat do We Want?\nWe strive to share the most reliable, interesting, and...Show more...Captain Altcoin is made up of investors and digital currency enthusiasts.\n\nWe have seen a strong need for better media coverage in the industry as the rise and popularity of digital currency is at an all-time high.\n\nWhat do We Want?\nWe strive to share the most reliable, interesting, and accurate information to our readers.\n","image":"https://cryptwerk.com/upload/companies/0/capitainaltcoin.jpg?1","tags":["News","Trading"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/captainaltcoin/","twitter":"https://twitter.com/CaptainAltcoin","pinterest":"https://www.pinterest.com/steffibayerr/pins/"}},{"name":"EasyBit","cryptocurrencies":["btc"],"description":"\nEasyBit is the world premier Bitcoin ATM company with nearly 50 machines in operation in over 10 countries. We provide a safe, easy to use, quick, and compliant way to buy and sell bitcoin through our digital currency kiosks. Our first bitcoin ATM was at Warie’s Thai Restaurant in Amsterdam...Show more...EasyBit is the world premier Bitcoin ATM company with nearly 50 machines in operation in over 10 countries. We provide a safe, easy to use, quick, and compliant way to buy and sell bitcoin through our digital currency kiosks. Our first bitcoin ATM was at Warie’s Thai Restaurant in Amsterdam (though it was later stolen).\n\nWe are a small company built for the bitcoin community by bitcoin enthusiasts. We were founded in December of 2013. We work with both BitAccess and GenesisCoin bitcoin ATM manufacturers in order to provide our operating partners and customers with the highest quality, fastest, and easiest use bitcoin ATMs in the world.\n","image":"https://cryptwerk.com/upload/companies/4000/easybit.jpg?1562848166","tags":[],"latLong":"45.580746,-84.696246","address":"411 North Main Street, Cheboygan, MI 49721, US","socials":{"facebook":"https://www.facebook.com/easybitllc","twitter":"https://twitter.com/easybitatm"}},{"name":"Round The Block","cryptocurrencies":["btc","eth","bch","ltc","bnb","dash","etc","btg","doge","qtum","dgb"],"description":"\nRound The Block takes the convenience and versatility of the world’s most famous cryptocurrency to a new level. It is currently difficult to use Bitcoin for real-world transactions in Australia, limiting your ability to make purchases or pay bills using the pioneering currency. You do have the...Show more...Round The Block takes the convenience and versatility of the world’s most famous cryptocurrency to a new level. It is currently difficult to use Bitcoin for real-world transactions in Australia, limiting your ability to make purchases or pay bills using the pioneering currency. You do have the option to exchange your Bitcoins for cash through an exchange like Coinbase, but there are also limits of $1,000 per transaction or up to $50,000 for a personal bank account and often the process is long and drawn out.\n\nThis is where Round the Block can make all the difference. Round The Block is a cryptocurrency marketplace; not an exchange like Coinbase. We give you more ways to spend your Bitcoin currency. You can...\n\nBuy gift cards\nMake bank transfers\nOr use BPAY.\nSpend your Bitcoin, Litecoin, Etherium money at a range of major retailers, pay your bills, or put money in your bank account, without paying any fees. Crypto-freedom is achieved.\n\nWe believe you should have more options to spend your Bitcoin currency the way you want to. Round The Block offers a simple way to sell Bitcoin in Australia and to release the value so you can buy things you want and need. You can also earn points and convert them into rewards in every transactions made and may take up to 3 business days to appear in your account.\n\nMany Aussies have learned the convenience and security of buying and selling online with Bitcoin, but they may have also experienced the limitations. If you’re looking for a more convenient way to spend Bitcoin, visit Round The Block today. There’s no easier way to put your Bitcoin to good use.\n\nConvert your cryptocurrency to cards you can spend at a range of major retailers, send to any Australian bank or pay your bills with BPAY.\n\nBuy gift cards, pay bills or BPAY\n\nSimplify the way you use your cryptocurrency. Purchase e-gift vouchers using Bitcoin and many other alt-coins, cash out directly to your bank account OR pay your bills/credit card via BPay.\n\nEarn Rewards Points\n\nSpend over $1,000 to start earning Rewards Points and Status Credits. Redeem Rewards Points by choosing from a range of gifts. Increase Status Credits and climb the Status Ladder to earn bonus vouchers, flights and much more. See our Rewards Page for more information.\n","image":"https://cryptwerk.com/upload/companies/2000/round-the-block.jpg?1555367608","tags":["GiftCards","Bills","Different"],"latLong":"-37.813628,144.963058","address":"Melbourne VIC, Australia","socials":{"facebook":"https://www.facebook.com/roundtheblockau","twitter":"https://twitter.com/RoundTheBlockAu","instagram":"https://www.instagram.com/roundtheblockau/"}},{"name":"TheBigCoin","cryptocurrencies":["btc","eth","bch","ltc","xmr","dash"],"description":"\nTheBigCoin offers a unique range of cryptocurrency solutions for both, business and consumers.\n\nFor business, we do offer Bitcoin & Cryptocurrency processing service with the lowest processing fee on the market of just 0.9%. Together with our intuitive payment gateway, which lets us achieve 2x...Show more...TheBigCoin offers a unique range of cryptocurrency solutions for both, business and consumers.\n\nFor business, we do offer Bitcoin & Cryptocurrency processing service with the lowest processing fee on the market of just 0.9%. Together with our intuitive payment gateway, which lets us achieve 2x higher conversion rate compared to competitors, already 3,851 businesses choose us for making them more successful online!\n\nFor consumers - a solution where you can spend your Bitcoin, Ethereum, Litecoin, Dash, and Monero anywhere online. No lengthy signup process. No private information required. Fully anonymous service to spend your Bitcoin on things you desire online, either it's an item you wanted to buy or a service you wanted to get, using TheBigCoin you can easily tap into whole world’s online stores and buy in Bitcoin or other cryptocurrency. The whole buying process is very smooth and takes just 3 minutes to complete the purchase.\n\nThe ultimate goal of TheBigCoin is to achieve mass adoption of cryptocurrencies. While now the biggest problem is that most of the cryptocurrency holders either just trade it, speculate or simply keep it as an investment. On the other hand, second problem is that there is almost nowhere you can spend it. 99% of the online stores still don't accept it! Through our service and technology customers finally can get access to shop in any online store and pay in Cryptocurrency.\n\nWe are an intermediate service helping to spend cryptocurrency, including Bitcoin, Ethereum, Litecoin, Dash, and Monero in any online store and any online service provider worldwide. At the moment 99% of the web still doesn’t accept cryptocurrency as a form of payment. We solve this problem by buying the product on your behalf, while at the same time receiving from you an equivalent amount of cryptocurrency.\n","image":"https://cryptwerk.com/upload/companies/0/thebigcoin.jpg?1","tags":["Marketplaces","Payment gateways"],"latLong":"undefined,undefined","socials":{"telegram":"https://t.me/thebigcoin","reddit":"https://www.reddit.com/r/TheBigCoin/","bitcointalk":"https://bitcointalk.org/index.php?topic=2152963"}},{"name":"Abra","cryptocurrencies":["btc","eth","xrp","bch","ltc","dash","etc","btg","doge","zrx","dgb","alts"],"description":"\nAt Abra, we’re making cryptocurrency investing simple. Abra operates an easy to use app — with 30 cryptocurrencies, 50 fiat currencies, and the BIT10 crypto index available. Users can buy, sell, store, and invest in cryptocurrencies, plus manage all crypto investments, in one place. Our...Show more...At Abra, we’re making cryptocurrency investing simple. Abra operates an easy to use app — with 30 cryptocurrencies, 50 fiat currencies, and the BIT10 crypto index available. Users can buy, sell, store, and invest in cryptocurrencies, plus manage all crypto investments, in one place. Our vision is an open, global financial system that is easily accessible to everyone.\n\nOur Values\nEMBRACE TRANSPARENCY\nAbra will be straightforward, transparent and honest with our customers, partners, and employees.\n\nDRIVE TOWARDS IMPACT\nAbra will have a positive impact on the lives of everyone in our ecosystem.\n\nFOCUS ON THE USER\nWe will put the user first. Get the user experience right and wow them and everything else is much easier.\n\nCHAMPION THE INDIVIDUAL\nWe believe in the individual’s right to freely participate in all forms of commerce.\n\nENCOURAGE NEW IDEAS\nWe believe that a diversity of ideas and backgrounds leads to better outcomes.\n\nTHINK LONG TERM\nAbra needs to be a sustainable business in order to add the most long term value.\n","image":"https://cryptwerk.com/upload/companies/3000/abra.jpg?1554308089","tags":["Buy / Sell","Wallets"],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/GoAbraGlobal","twitter":"https://twitter.com/AbraGlobal","linkedin":"https://www.linkedin.com/company/abra/","reddit":"https://www.reddit.com/user/AbraGlobal/"}},{"name":"Escrowmybits.com","cryptocurrencies":["btc"],"description":"\nWelcome to the world's simplest Bitcoin based escrow service, proudly powered by Bitreserve. Only 3 Steps to get started.\nEscrow my bits was created to solve all the problems wrong with the type of escrow services currently around. For example no bitcoin escrow service lets you deposit bitcoins...Show more...Welcome to the world's simplest Bitcoin based escrow service, proudly powered by Bitreserve. Only 3 Steps to get started.\nEscrow my bits was created to solve all the problems wrong with the type of escrow services currently around. For example no bitcoin escrow service lets you deposit bitcoins and then pin them to a fiat value. We also wanted to make an escrow service that was simple and easy for the everyday user to use.\n\nHow it works?\nWelcome to the world's simplest Bitcoin based escrow service, proudly powered by Coinapult. All it takes is 3 easy steps to get started :\n\n1. Choose the type of escrow and if you are the buyer or seller\n2. Enter the buyer's and seller's email and/or public key\n3. Enter the amount in USD or BTC, and press Submit!*\nWe keep your funds as secure as possible either being stored with Coinapult for transactions fixed to a fiat value or in cold storage.\n\n* We charge a 1% Fee for using our service\n","image":"https://cryptwerk.com/upload/companies/0/escrowmybits-com.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/escrowmybits","youtube":"https://www.youtube.com/user/escrowmybits","reddit":"https://www.reddit.com/r/escrowmybits"}},{"name":"MyCryptoCheckout","cryptocurrencies":["btc","eth","ltc","bch","dash","doge","xrp","xmr","etc","zec","trx","eos","dgb","btg","bnb","dcr","usdt","xlm","waves","omg","grs","smart","zrx","nem","xvg","erc20"],"description":"\nCryptocurrency payment gateway for WooCommerce and Easy Digital Downloads.\n\nKey Features & Highlights\n- 0% transaction fees\n- No KYC or product restrictions\n- Peer-to-peer transactions\n- No redirection to 3rd parties\n- Use any crypto wallet\n- Automagically detect unique payments using...Show more...Cryptocurrency payment gateway for WooCommerce and Easy Digital Downloads.\n\nKey Features & Highlights\n- 0% transaction fees\n- No KYC or product restrictions\n- Peer-to-peer transactions\n- No redirection to 3rd parties\n- Use any crypto wallet\n- Automagically detect unique payments using one wallet address\n- Hierarchically deterministic (HD) wallet support\n- 1-Click payment buttons, MetaMask, Waves Client, etc.\n- Fiat autosettlement enables you to connect to exchange(s) and instantly convert selected coins to fiat or stablecoins\n- Donations widget\n- Tor support\n","image":"https://cryptwerk.com/upload/companies/2000/mycryptocheckout-com.jpg?1551824099","tags":[],"latLong":"42.867598,-71.036482","address":"77 S Main St #538 Newton, NH 03858","socials":{"twitter":"https://twitter.com/MCryptoCheckout","youtube":"https://www.youtube.com/channel/UCExSIQFsW5LzfhDtf0FDHBA","github":"https://github.com/MyCryptoCheckout/wordpress"}},{"name":"Bestmixer.io","cryptocurrencies":["btc","eth","bch","ltc"],"description":"\nBestMixer.io is the web's most trusted Bitcoin mixer (or tumbler) for making your transactions and digital assets anonymous on the blockchain.\n\nBitcoin mixing with our service works by sending your coins to our secure pool where they are then mixed with coins belonging to others. You'll...Show more...BestMixer.io is the web's most trusted Bitcoin mixer (or tumbler) for making your transactions and digital assets anonymous on the blockchain.\n\nBitcoin mixing with our service works by sending your coins to our secure pool where they are then mixed with coins belonging to others. You'll receive coins from wallets which are unrelated to yours, thereby breaking the link between your old and new wallets and giving you the freedom to transact anonymously on the blockchain.\n\nBestMixer.io supports mixing for bitcoin, ethereum, bitcoin cash, and litecoin, giving you a wide variety of options for preserving your privacy!\n\nBestMixer.io's mission is to guarantee the security, privacy, and anonymity of its clients through the support of our industry-leading bitcoin mixer technology. Our service has been documented and exceedingly well-reviewed since its inception on Bitcointalk.org, the world's largest cryptocurrency social platform. If you're wondering why you it is necessary to use a Bitcoin mixer, feel free to read our FAQ, otherwise go ahead and get mixing!\n","image":"https://cryptwerk.com/upload/companies/1000/bestmixer-io.jpg?1543097710","tags":[],"latLong":"undefined,undefined","socials":{"twitter":"https://twitter.com/BestMixerIO","github":"https://github.com/BestMixer","bitcointalk":"https://bitcointalk.org/index.php?topic=3140140.0"}},{"name":"Pandaminer","cryptocurrencies":["btc"],"description":"\nPandaMiner is a professional cryptocurrency hardware R&D technology company. With strong technology and R&D strength, PandaMiner stands out in the field of graphics card mining, and successfully produces stable integrated graphic card miners with high performance and low power consumption....Show more...PandaMiner is a professional cryptocurrency hardware R&D technology company. With strong technology and R&D strength, PandaMiner stands out in the field of graphics card mining, and successfully produces stable integrated graphic card miners with high performance and low power consumption. PandaMiner has units that make miner R&D, cloud mining, miner hosting, mining pool, almost covers the entire cryptocurrency mining industry chain. Our vision is to perfect our products to meet the demands of the ever-growing mining industry and make mining simple.\n\nFounded in 2016, PandaMiner is headquartered in Shenzhen, China. With superior geographical advantages, we quickly integrates professional talents and production resources, successfully creating our own core competitiveness in the cryptocurrency mining industry. Oriented to the global market, Pandaminer is dedicated to continuously delivering value to the entire industry chain of cryptocurrency mining. \n\nThe team is comprised of professionals and experts in digital hardware, Internet, and cryptocurrency field, which possess a broad global perspective and excellent strategic planning as well as execution capabilities. On November 12, 2016, the official website of the PandaMiner released its first batch of pre-sales on the entire network. In 2017, with the great upspring of graphics mining industry, PandaMiner's overall business has witnessed a doubled growth.\n\nSo far, PandaMiner has served in cryptocurrency mining enthusiasts in more than 60 countries world-widely, covering the entire cryptocurrency mining industry chain including miner R&D, cloud mining, miner hosting, and mining pool.\n\nPandaMiner's Vision: Make Mining Simple.\n","image":"https://cryptwerk.com/upload/companies/0/pandaminer.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/Panda%20Miner-1029835897114795/","twitter":"https://twitter.com/PandaMiner_"}},{"name":"BitcoinMix","cryptocurrencies":["btc"],"description":"\nBitcoinMix is a service offered to mix potentially identifiable or 'tainted' cryptocurrency funds with others, so as to obscure the trail back to the fund's original source.\n","image":"https://cryptwerk.com/upload/companies/6000/bitcoinmix.jpg?1564225470","tags":[],"latLong":"15.512288,-4.094782","address":"niama takova 20","socials":{"telegram":"https://t.me/jambler","bitcointalk":"https://www.reddit.com/user/Jambler_io/"}},{"name":"MyCoinCloud","cryptocurrencies":["btc"],"description":"\nWe are cryptocurrency cloud mining service situated in the capital of Bulgaria, Sofia. MyCoinCloud was founded at the end of 2015 by group of cryptocurrency enthusiasts and specialists. We strongly believe that we can make mining affordable and profitable for everyone willing to join...Show more...We are cryptocurrency cloud mining service situated in the capital of Bulgaria, Sofia. MyCoinCloud was founded at the end of 2015 by group of cryptocurrency enthusiasts and specialists. We strongly believe that we can make mining affordable and profitable for everyone willing to join cryptocurrency revolution.\n\nOn a larger scale, we hope to contribute to the development of mining services and subsequently to the development, establishment and adoption of Bitcoin, both as a currency and as an economic system. This is an investment in high technologies. You are renting a computing technic for holding up the bitcoin meshwork.\n","image":"https://cryptwerk.com/upload/companies/1000/mycoincloud.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/mycoincloud","twitter":"https://twitter.com/mycoincloud"}},{"name":"Giga Watt","cryptocurrencies":["btc","bch","ltc"],"description":"\nGigaWatt provides Turnkey mining services or custom packages tailored to your needs: full range of mining services from equipment sales, maintenance and repair to private blockchain servicing.\n","image":"https://cryptwerk.com/upload/companies/1000/giga-watt.jpg?1","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/gigawattcom","twitter":"https://twitter.com/gigawatt_mining","instagram":"https://instagram.com/gigawatt_mining","medium":"https://medium.com/gigawatt"}},{"name":"Elite Capital Market","cryptocurrencies":["btc","eth","ltc","xrp","bnb","usdt"],"description":"\nECM is a client oriented company, created with the sole aim of making Forex,stocks and cryptocurrency trading and investments profitable to investors. Elite capital market is based on a unique technology for cryptocurrency trading, Forex margin trading and stock CFD trading. \nOur goal is to...Show more...ECM is a client oriented company, created with the sole aim of making Forex,stocks and cryptocurrency trading and investments profitable to investors. Elite capital market is based on a unique technology for cryptocurrency trading, Forex margin trading and stock CFD trading. \nOur goal is to make cryptocurrency trading, Forex and stock trading accessible to all users regardless of age, location, investment, technical no use or experience. We want to give our partners an opportunity to get involve and earn in this evolving billion-dollar industry\n","image":"https://cryptwerk.com/upload/companies/7000/elite-capital-market.jpg?1565537445","tags":["Trading","Blockchain"],"latLong":"17.492393,-88.210662","address":"16 Hudson street Belize City, Belize.","socials":{"facebook":"https://www.facebook.com/ecmsofficial/","instagram":"https://www.instagram.com/elitecapitalmarket/?hl=en"}},{"name":"Ezzocard.com","cryptocurrencies":["btc","eth"],"description":"\nAll about virtual credit cards\n\nNowadays, payment for goods and services via the Internet is as common as shopping in an offline store. The main tools for online payment are bank cards, which are used to be called like “credit cards”. The most important position among them is taken by...Show more...All about virtual credit cards\n\nNowadays, payment for goods and services via the Internet is as common as shopping in an offline store. The main tools for online payment are bank cards, which are used to be called like “credit cards”. The most important position among them is taken by prepaid cards.\n\nSo, what is a prepaid card, and what is it used for?\n\nA prepaid credit card is a card, which has a certain amount by the time of purchase. It allows you to make purchases or pay for services on the same principle as a regular card, but a prepaid card cannot be recharged. Payments are made on behalf of the issuing bank, not by the cardholder. It allows to use some types of prepaid cards anonymously, particularly Ezzocard. This important point would be explained later on.\n\nVirtual credit card (VCC) is a complete analogue of the usual plastic credit card. It has exactly the same data set: a card number, an expiration date, a security code and a pin code. The main difference of a virtual card from the regular one is that the virtual one hasn’t a physical carrier and can’t be held in hands. At the same time, using a virtual card, you can also make purchases on the Internet and make payments via telephone.\n\nWhat is the advantage of virtual prepaid card comparing to regular? It could be purchased online at any time around a clock and get ready to use immediately, purchasing goods and services.\n","image":"https://cryptwerk.com/upload/companies/2000/ezzocard-com.jpg?1552723620","tags":[],"latLong":"undefined,undefined","socials":{}},{"name":"Cloudnet Recovery","cryptocurrencies":["btc"],"description":"\nCloudnet Recovery is a consulting firm that specialises in the recovery of assets from financial fraud.Focusing on Binary Options, Crypto Currencies, CFD’S and Forex scams, we have collected the biggest data base by far on all of those scam brokers.The magnitude of this type of financial fraud...Show more...Cloudnet Recovery is a consulting firm that specialises in the recovery of assets from financial fraud.Focusing on Binary Options, Crypto Currencies, CFD’S and Forex scams, we have collected the biggest data base by far on all of those scam brokers.The magnitude of this type of financial fraud is bigger than most people know. There are tens of millions of victims every single year throughout the world.We know how to recover your funds and we helped thousands of scam victims from around the world to recover their funds.\n","image":"https://cryptwerk.com/upload/companies/7000/cloudnet-recovery.jpg?1567846992","tags":["Mining","Cloud"],"latLong":"34.070441,-118.397317","address":"809 Noth Rexford drive Beverly Hill, California, 90210 United States","socials":{"twitter":"https://twitter.com/cloudnet_recovery","instagram":"https://www.instagram.com/cloudnet_recovery/"}},{"name":"ARKONIX GmbH","cryptocurrencies":["btc","eth","bch","xmr","zec"],"description":"\nArkonix is the only Swiss Company offering accessible and secure Cloud-Mining solutions to everyone. We strive to ensure that Cryptocurrency remains decentralized by contributing to the network whilst sharing most of the gained mining incentives with our customers.\n","image":"https://cryptwerk.com/upload/companies/7000/arkonix-gmbh.jpg?1570735497","tags":[],"latLong":"46.0054028,8.881558","address":"Ur Stradon 38 6994 Aranno Switzerland","socials":{"facebook":"https://www.facebook.com/ArkonixMining/","twitter":"https://twitter.com/ArkonixMining","linkedin":"https://www.linkedin.com/company/arkonixmining/"},"fiatPaymentModes":["CreditCard"]},{"name":"ViaBTC","cryptocurrencies":["btc","eth","bch","ltc","dash","etc","zec"],"description":"\nViaBTC (Viabtc Technology Limited) was founded in May 2016 as an innovation-intensive startup dedicated to cryptocurrency. We’ve developed the world’s top Bitcoin mining pool with the most advanced deployment technology. We’ve also released mining pools for competing coins and cloud mining...Show more...ViaBTC (Viabtc Technology Limited) was founded in May 2016 as an innovation-intensive startup dedicated to cryptocurrency. We’ve developed the world’s top Bitcoin mining pool with the most advanced deployment technology. We’ve also released mining pools for competing coins and cloud mining products. More new product and services are in our pipeline, our ultimate mission is - Via Bitcoin, Making The World A Better Place.\n","image":"https://cryptwerk.com/upload/companies/1000/viabtc.jpg?2","tags":[],"latLong":"undefined,undefined","socials":{"facebook":"https://www.facebook.com/viabtc","twitter":"https://twitter.com/viabtc"}},